brew 'bat'
brew 'bundletool'

# brew 'cocoapods' it gets installed on its own, somehow
brew 'coreutils'
# brew 'fastlane' install through gem
brew 'fd'
brew 'ffmpeg'
# brew 'firebase-cli'

brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'go'
brew 'gpg'
brew 'grep'
brew 'htop'

brew 'imagemagick'
brew 'ios-deploy'

brew 'kotlin'
brew 'ktlint'

brew 'lsd'

brew 'ncdu'
brew 'neofetch'
brew 'nmap'

brew 'mas'
brew 'micro'
brew 'mosh'

brew 'openvpn'

# brew 'poetry' use pyenv-installed Python instead, see https://github.com/Homebrew/homebrew-core/issues/53169
brew 'pyenv'

brew 'rbenv'
brew 'rustup'

brew 'tldr'
brew 'tree'

brew 'webp'
brew 'wget'
brew 'youtube-dl'
brew 'zsh'

cask '1password'
cask '1password-cli'

cask 'android-file-transfer'
cask 'arduino'
cask 'blender'
cask 'brooklyn'
cask 'daisydisk'
cask 'discord'
cask 'gimp'
cask 'gitkraken'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-backup-and-sync'
cask 'gpg-suite'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'mos'
cask 'openvpn-connect'
cask 'postman'
cask 'sequel-pro'
cask 'sf-symbols'
cask 'skype'
cask 'spotify'
cask 'raspberry-pi-imager'
cask 'qlimagesize'
cask 'qlstephen'
cask 'quicklook-json'
cask 'quicklookapk'
cask 'unity-hub'
cask 'visual-studio-code'
cask 'zoom'

# Specific taps

tap 'schollz/tap'
brew 'croc'

# Microsoft
cask 'microsoft-word'
cask 'microsoft-excel'
cask 'microsoft-powerpoint'
cask 'microsoft-teams'
cask 'onedrive'

# OpenJDK 8 for use with android-studio
tap 'AdoptopenJDK/openjdk'
cask 'adoptopenjdk/openjdk/adoptopenjdk8'

tap 'tinygo-org/tools'
brew 'tinygo'

tap 'homebrew/cask-fonts'
cask 'font-jetbrains-mono'

# Font needed by lsd
cask 'font-hack-nerd-font'

tap 'heroku/brew'
brew 'heroku'

tap 'dart-lang/dart'
brew 'dart'

tap 'teamookla/speedtest'
brew 'speedtest'

tap 'microsoft/git'
cask 'git-credential-manager-core'

mas 'Keynote', id: 409183694
mas 'Notability', id: 736189492
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Telegram', id: 747648890
mas 'Slack', id: 803453959
mas 'iMovie', id: 408981434
mas 'Amphetamine', id: 937984704
mas 'Termius - SSH client', id: 1176074088
mas 'Xcode', id: 497799835
